IDENTIFICATION DIVISION.
PROGRAM-ID. ATMWITHD.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT BTRANFLE ASSIGN TO BTRANFDD
    ORGANIZATION IS INDEXED
    ACCESS MODE IS SEQUENTIAL/RANDOM
    RECORD KEY IS WS-TXN-ID 
    FILE STATUS IS WS-FILE-STATUS.

    SELECT 
