IDENTIFICATION DIVISION.
PROGRAM-ID. BANKACCINQ.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELCT BANK-FILE ASSIGN TO BANK-FILE-DD
        ORGANIZATION IS INDEXED
        ACCESS MODE IS SEQUENTIAL
        RECORD KEY IS ACC-NUMBER
        FILE-STATUS IS WS-FILE-STATUS.
DATA DIVISION.
FILE SECTION.
FD BANK-FILE.
    01 FORD-BANK-RECORD.
        05 ACC-NUMBER      PIC 9(10).
        05 NAME            PIC X(30).
        05 BALANCE         PIC 9(10)V99 COMP-3.
        05 STATUS          PIC X(1).
WORKING-STORAGE SECTION.
EXEC SQL
    INCLUDE SQLCA
END-EXEC.

01 WS-ACC-NUMBER PIC 9(10).
01 WS-NAME       PIC X(30).
01 WS-BALANCE    PIC 9(10)V99 COMP-3.
01 WS-STATUS     PIC X(1).

PROCEDURE DIVISION.
MAIN-PARA.
    DIAPLAY '****************************'
    DISPLAY 'FORD ACCOUNT BANK INQUIRY'.
    DIAPLAY '****************************'

    DISPLAY 'ENTER FORD ACCOUNT NUMBER: '
    ACCEPT WS-ACC-NUMBER

    EXEC SQL
        SELECT ACCOUNT-NUMBER,
               NAME,
               BALANCE,
               STATUS
        INTO
            :WS-ACC-NUMBER,
            :WS-NAME,
            :WS-BALANCE,
            :WS-STATUS
        FROM FORD-BANK-ACCOUNT
        WHERE
            ACCOUNT-NUMBER = WS-ACC-NUMBER
    END-EXEC.

EVALUATE TRUE
    WHEN SQLCODE = 0
        DISPLAY 'ACCOUNT NUMBER: ' WS-ACC-NUMBER
        DISPLAY 'CUSTOMER NAME: ' WS-NAME
        DISPLAY 'BALANCE: ' WS-BALANCE
        DISPLAY 'STATUS: ' WS-STATUS
    WHEN SQLCODE = 100
        DISPLAY 'ACCOUNT NOT FOUNT'
        DISPLAY 'SQL CODE: ' SQLCODE
        DISPLAY 'ACCOUNT NUMER: ' WS-ACC-NUMBER
    WHEN OTHER
        DISPLAY 'DB2 ERROR OCCURRED.'
        DIAPLAY 'SQL CODE: ' SQLCODE
        DISPLAY 'SQL STATE: ' SQLSTATE
END-EVALUATE.

    EXEC SQL
        COMMIT
    END-EXEC.

STOP RUN.

