IDENTIFICATION DIVISION.
PROGRAM-ID. BANK-ACC-TRNX.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT BANK-TRNX ASSIGN TO BANK-TRNX-DD
        ORGANIZATION IS INDEXED
        ACCESS MODE IS SEQUENTIAL
        RECORD KEY IS TRNX-ID
        FILE-STATUS IS WS-FILE-STATUS.
DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 WS-FILE-STATUS PIC XX.

EXEC SQL
    INCLUDE SQLCA
END-EXEC.

EXEC SQL 
    INCLUDE TRANS-DCLG
END-EXEC.

EXEC SQL
    DECLARE C1 CURSOR FOR
        SELECT TXN_ID,
            ACCOUNT_NO,
            TXN_TYPE,
            TXN_AMOUNT
        FROM BANK_TRANSACTION
        WHERE STATUS = 'P'
        ORDER BY TXN_DATE
END-EXEC.

01 WS-TXN-ID PIC X(20).
01 WS-ACCOUNT-NO PIC X(12).
01 WS-TXN-TYPE PIC X(1).
01 WS-TXN-AMOUNT PIC S9(13)V99 COMP-3.

01 WS-BALANCE PIC S9(13)V99 COMP-3.
01 WS-STATUS PIC X(1).

01 WS-NEW-BALANCE PIC S9(13)V99 COMP-3.
01 WS-ROWS PIC S9(4) COMP.

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY 'BANK TRANSACTION PROCESS STARTED.'

    EXEC SQL
        OPEN C1
    END-EXEC.

    PERFORM UNTIL SQLCODE = 100
        EXEC SQL
            FETCH C1
            INTO :WS-TXN-ID,
                :WS-ACCOUNT-NO,
                :WS-TXN-TYPE,
                :WS-TXN-AMOUNT
        END-EXEC.

        EVALUATE SQLCODE
            WHEN 0
                PERFORM 1000-PROCESS-TRANSACTION
            WHEN 100
                DISPLAY 'END OF THE TABLE.'
                DIAPLAY 'SQL CODE: ' SQLCODE
            WHEN OTHER
                DISPLAY 'DB2 FETCH ERROR.'
                DISPLAY 'SQL CODE: ' SQLCODE
                MOVE 12 TO RETURN-CODE
                GO BACK
        END-EVALUATE
    END-PERFORM.

    EXEC SQL
        CLOSE C1
    END-EXEC.

    GO BACK.

1000-PROCESS-TRANSACTION.
    EXEC SQL
        SELECT BALANCE,
            STATUS
        INTO :WS-BALANCE,
            :WS-STATUS
        FROM ACCOUNT
        WHERE ACCOUN_NO = WS-ACCOUNT-NO
        FOR UPDATE OF BALANCE
    END-EXEC.

    IF SQLCODE NOT = 0
        DISPLAY 'ACCOUNT ERROR.'
        EXIT PARAGRAPH
    END-IF.

    IF WS-STATUS NOT = 'A'
        DISPLAY 'ACCOUNT INACTIVE: ' WS-ACCOUNT-NO
        EXIT PARAGRAPH
    END-IF.

    IF WS-TXN-TYPE = 'D'
        IF WS-BALANCE < WS-TXN-AMOUNT
            DISPLAY 'INSUFFICIENT BALANCE.'
            EXIT PARAGRAPH
        END-IF.

        COMPUTE WS-NEW-BALANCE = WS-BALANCE - WS-TXN-AMOUNT

        ELSE
            COMPUTE WS-NEW-BALANCE = WS-BALANCE + WS-TXN-AMOUNT
    END-IF.

    EXEC SQL
        UPDATE BANK_TRANSACTION
         SET STATUS = 'S'
        WHERE TXN-ID = :WS-TXN-ID
    END-EXEC.

    EXEC SQL
        COMMIT
    END-EXEC.