IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTREPT.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CUSTOMER-FILE ASSIGN TO CUSTIN
    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE IS SEQUENTIAL.

    SELECT REPORT-FILE ASSIGN TO REPORT
    ORGANIZATION IS SEQUENTIAL.
    ACCESS MODE IS SEQUENTIAL.

DATA DIVISION.

FILE SECTION.
FD CUSTOMER-FILE.
    RECORD CONTAINS 45 CHARACTERS.

01 CUSTOMER-RECORD.
    05 IN-CUST-ID   PIC X(6).
    05 IN-CUST-NAME PIC X(30).
    05 IN-BALANCE   PIC 9(9).  

/* INPUT RECORDS
000001SAKTHI PRIYAN                  000350000
000002PIYU BUDDU                     000400000
000003BUDDU ROE                      002500000
*/

FD REPORT-FILE.
    RECORD CONTAINS 80 CHARACTERS.

01 REPORT-RECORD PIC X(80).

WORKING-STORAGE SECTION.
01 WS-EOF     PIC X(1) VALUE 'N'.
01 WS-BALANCE PIC 9(9).

01 WS-REPORT-LINE.
    05 FILLER         PIC X(3) VALUE SPACES.
    05 WS-CUST-ID     PIC X(6).
    05 FILLER         PIC X(3) VALUE SPACES.
    05 WS-CUST-NAME   PIC X(30).
    05 FILLER         PIC X(3) VALUE SPACES.
    05 WS-BALANCE-OUT PIC ZZ,ZZZ,ZZ9.99.

PROCEDURE DIVISION.

0000-MAIN-PARA.
    DISPLAY 'CUSTOMER REPORT PROCESS STARTED.'

    PERFORM 1000-INITIALIZE THRU 1000-EXIT
    PERFORM UNTIL WS-EOF = 'Y'
        PERFORM 2000-PROCESS THRU 2000-EXIT UNTIL WS-EOF = 'Y'
    END-PERFORM
    PERFORM 3000-TERMINATE THRU 3000-EXIT

    STOP RUN.

1000-INITIALIZE.
    OPEN INPUT CUSTOMER-FILE
         OUTPUT REPORT-FILE

    MOVE SPACES TO REPORT-RECORD
    MOVE '       CUSTOMER ACCOUNT REPORT  '
            TO REPORT-RECORD
    WRITE REPORT-RECORD

    MOVE SPACES TO REPORT-RECORD
    MOVE '-----------------------------------------'
            TO REPORT-RECORD
    WRITE REPORT-RECORD

    MOVE ' CUSTOMER-ID   CUSTOMER-NAME                   BALANCE '
            TO REPORT-RECORD
    WRITE REPORT-RECORD

    MOVE '-----------------------------------------'
            TO REPORT-RECORD
    WRITE REPORT-RECORD

    READ CUSTOMER-FILE
            AT-END
                MOVE 'Y' TO WS-EOF
    END-READ.

1000-EXIT.
    EXIT.

2000-PROCESS.
    IF WS-EOF = 'N'
        MOVE IN-CUST-ID TO WS-CUST-ID
        MOVE IN-CUST-NAME TO WS-CUST-NAME
        MOVE IN-BALANCE TO WS-BALANCE

        MOVE WS-BALANCE TO WS-BALANCE-OUT

        MOVE SPACES TO REPORT-RECORD
        MOVE WS-REPORT-LINE TO REPORT-RECORD
        WRITE REPORT-RECORD

        READ CUSTOMER-FILE
            AT END 
                MOVE 'Y' TO WS-EOF
        END-READ

    END-IF.

2000-EXIT.
    EXIT.

3000-TERMINATE
    MOVE '-------------------------------------------'
            TO REPORT-RECORD
    WRITE REPORT-RECORD
    
    CLOSE CUSTOMER-FILE
          REPORT-FILE. 

3000-EXIT.
    EXIT.




