IDENTIFICATION DIVISION.
PROGRAM-ID. DATETIME.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
WORKING-STORAGE DIVISION.
/* 01 WS-CURRENT-DATETIME PIC X(21).

01 WS-CURRENT-DATE PIC X(8).
01 WS-DISPLAY-DATE PIC X(10).

PROCEDURE DIVISION.
0000-MAIN-PARA.
    DISPLAY 'RETRIVE CURENT DATE'

    MOVE FUNCTION CURRENT-DATE(1:8) TO WS-CURRENT-DATE
    DISPLAY WS-CURRENT-DATE

    MOVE WS-CURRENT-DATE(1:4) TO WS-DISPLAY-DATE(1:4)
    MOVE '-' TO WS-DISPLAY-DATE(5:1)

    MOVE WS-CURRENT-DATE(5:2) TO WS-DISPLAY-DATE(6:2)
    MOVE '-' TO WS-DISPLAY-DATE(8:1)

    MOVE WS-CURRENT-DATE(7:2) TO WS-DISPLAY-DATE(9:2)

    DISPLAY 'CURRENT DATE: ' WS-DISPLAY-DATE

    STOP-RUN.