IDENTIFICATION DIVISION.
PROGRAM-ID. DB2VSAM1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT VSAMFILE ASSIGN TO VSAMDD
         ORGANIZTION IS INDEXED
         ACCESS MODE IS SEQUENTIAL
         RECORD KEY IS VSAM-ACC-NO
         FILE STATUS IS WS-FILE-STATUS.
DATA DIVISION.
FILE SECTION.
FD VSAMFILE
   RECORD CONTAINS 71 CHARACTERS
   01 VSAM-RECORD.
      05 VSAM-ACC-NO PIC X(10).
      05 VSAM-CUST-NAME   PIC X(30).
      05 VSAM-BALANCE PIC 9(9)V99 COMP-3.
      05 VSAM-TRANS-AMT PIC 9(9)V99 COMP-3.
      05 VSAM-AVAILABLE-BAL PIC 9(9)V99 COMP-3.
      05 VSAM-STATUS PIC X(1).
WORKING-STORAGE SECTION.
** HOST VARIABLES  **
EXEC SQL
    INCLUDE SQLCA
END-EXEC.

EXEC SQL
    INCLUDE BANK
END-EXEC.