IDENTIFICATION DIVISION.
PROGRAM-ID. DB2VSAM.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT VSAMFILE ASSDIGN TO VSAMOUT
	ORGANIZATION IS INDEXED
	ACCESS MODE IS SEQUENTIAL
	RECORD KEY IS VSAM-ACC-NO
	FILE STATUS IS WS-FILE-STATUS
DATA DIVISION.
FILE SECTION.
FD VSAMFILE.
   RECORD CONTAINS 61 CHARACTERS.
   01 VSAM-RECORD.
      05 VSAM-ACC-NO        PIC X(10).
	  05 VSAM-CUST-NAME     PIC X(30).
	  05 VSAM-BALANCE       PIC 9(9)V99.
	  05 VSAM-TRANS-AMOUNT  PIC 9(9)V99.
	  05 VSAM-AVAILABLE-BAL PIC 9(9)V99.
	  05 VSAM-STATUS        PIC X(1).
WORKING-STORAGE SECTION.

** DB2 HOST VARIABLES **
EXEC SQL
    INCLUDE SQLCA
END-EXEC.

01 WS-ACC-NO        PIC X(10).
01 WS-CUST-NAME     PIC x(30).
01 WS-BALANCE       PIC 9(9)V99 COMP-3.
01 WS-TRANS-AMOUNT  PIC 9(9)V99 COMP-3.
01 WS-AVAILABLE-BAL PIC 9(9)V99 COMP-3.
01 WS-STATUS        PIC X(1).

**  FILE STATUS  **
01 WS-FILE-STATUS PIC X(2).

**  COUNTERS  **
01 WS-READ-COUNT  PIC 9(9) VALUE 0.
01 WS-WRITE-COUNT PIC 9(9) VALUE 0.
01 WS-ERROR-COUNT PIC 9(9) VALUE 0.

**  COMMIT COUNTER  **
01 WS-COMMIT-COUNT PIC 9(5) VALUE 0.

**  DISPLAY FIELDS  **
01 WS-DISP-SQLCODE     PIC 9(9).
01 WS-DISP-FILE-STATUS PIC X(2).

**  CONSTANTS  **
01 WS-EOF  PIC X VALUE 'N'.
   88 END-OF-DATA VALUE 'Y'.
   
01 WS-VALID-RECORD PIC X VALUE 'Y'.
   88 VALID-RECORD VALUE 'Y'.
   88 INVALID-RECORD VALUE 'N'.
   
01 WS-COMMIT-LIMIT PIC 9(3) VALUE 100.

**  DB2 CURSOR  **

EXEC SQL
   DECLARE C1 CURSOR FOR
     SELECT ACCOUNT_NO,
	   CUST-NAME,
	   BALANCE,
	   TRANS-AMOUNT,
	   STATUS
	 FROM BANK_ACCOUNT
     WHERE STATUS = 'A'
     ORDER BY ACCOUNT_NO	 
END-EXEC.

PROCEDURE DIVISION.
0000-MAIN-PARA.
    DISPLAY "BANK DB2 TO VSAM PROCESS STARTED."
	
	PERFORM 1000-OPEN-FILES THRU 1000-EXIT
	PERFORM 2000-OPEN-CURSOR THRU 2000-EXIT
    PERFORM UNTIL END-OF-DATA	
	   PERFORM 3000-FETCH-DB2 THRU 3000-EXIT
	   IF NOT END-OF-DATA
	      PERFORM 4000-VALIDATE-DATA THRU 4000-EXIT 
		  IF VALID-RECORD
		     PERFORM 5000-BUSINESS-LOGIC THRU 5000-EXIT
			 PERFORM 6000-WRITE-VSAM THRU 6000-EXIT
		  ELSE
		     ADD 1 TO WS-ERROR-COUNT
		  END-IF
        END-IF
    END-PERFORM 
    PERFORM 7000-CLOSE-CURSOR THRU 7000-EXIT
    PERFORM 8000-CLOSE-FILES THRU 8000-EXIT
    PERFORM 9000-DISPLAY-RESULT THRU 9000-EXIT
    GOBACK.

1000-OPEN-FILES.
    OPEN OUTPUT VSAMFILE
    IF FILE-STATUS NOT = '00'
       DISPLAY 'VSAM FILE OPEN ERROR.' 
	   DISPLAY 'FILE STATUS: ' WS-FILE-STATUS
       MOVE 12 TO RETURN-CODE
	   GOBACK
	END-IF
	
	DISPLAY 'VSAM FILE OPENED SUCCESSFULLY.'

1000-EXIT.
    EXIT.
	
2000-OPEN-CURSOR.
    EXEC SQL
	   OPEN C1
	END-EXEC
	
	IF SQLCODE NOT = 0
	   DISPLAY 'DB2 CURSOR OPEN FAILED.'
	   MOVE 12 TO RETURN-CODE
	   GOBACK
	END-IF
	
	DISPLAY 'CURSOR OPENED SUCCESSFULLY.'

2000-EXIT.
    EXIT.
	
3000-FETCH-DB2.	
    EXEC SQL
	   FETCH C1
	   INTO
	     :WS-ACC-NO,
		 :WS-CUST-NAME,
		 :WS-BALANCE,
		 :WS-TRANS-AMOUNT,
		 :WS-STATUS
	END-EXEC.
	
	EVALUATE SQLCODE
	 WHEN 0
	    ADD 1 TO WS-READ-COUNT
	 WHEN 100
        SET END-OF-DATA TO TRUE
        DISPLAY 'END OF DB2 DATA REACHED.'		
	 WHEN OTHER
	    DISPLAY 'DB2 FETCH ERROR.'
		DISPLAY 'SQL CODE:'SQLCODE
		DISPLAY 'ACCOUNT: ' WS-ACC-NO
        ADD 1 TO WS-ERROR-COUNT
        MOVE 12 TO RETURN-CODE 
        SET END-OF-DATA TO TRUE
    END-EVALUATE.

3000-EXIT.
    EXIT.
	
4000-VALIDATE-DATA
    SET VALID-RECORD TO TRUE
    IF WS-ACC-NO = SPACES
       DISPLAY 'INVALID ACCOUNT NUMBER.'
       SET INVALID-RECORD TO TRUE
    END-IF
    IF WS-STATUS NOT = 'A'
       DISPLAY 'INVALID ACCOUNT STATUS'
       DISPLAY 'ACCOUNT_NO: ' WS-ACC-NO
       SET INVALID-RECORD TO TRUE
    END-IF

4000-EXIT.
    EXIT.
	
5000-BUSINESS-LOGIC
    COMPUTE WS-AVAILABLE-BAL = WS-BALANCE - WS-TRANS-AMOUNT
	
	IF WS-AVAILABLE-BAL < 0
	   DISPLAY 'INSUFFICIENT BALANCE.'
	   DISPLAY 'ACOUNT: ' WS-ACC-NO
	   MOVE 0 TO WS-AVAILABLE-BAL
	END-IF

5000-EXIT.
    EXIT.
	
6000-WRITE-VSAM.
    MOVE WS-ACC-NO TO VSAM-ACC-NO
    MOVE WS-CUST-NAME TO VSAM-CUST-NAME
    MOVE WS-BALANCE TO VSAM-BALANCE
    MOVE WS-TRANS-AMOUNT TO VSAM-TRANS-AMOUNT
    MOVE WS-AVAILABLE-BAL TO VSAM-AVAILABLE-BAL
    MOVE WS-STATUS TO VSAM-STATUS
    
    WRITE VSAM-RECORD
  
    EVALUATE WS-FILE-STATUS
        WHEN '00'
           ADD 1 TO WS-WRITE-COUNT
           ADD 1 TO WS-COMMIT-COUNT
        WHEN OTHER
           DISPLAY 'VSAM WRITE ERROR.'
           DISPLAY 'FILE STATUS: ' WS-FILE-STATUS
           DISPLAY 'ACCOUNT: ' WS-ACC-NO
           ADD 1 TO WS-ERROR-COUNT
    END-EVALUATE.

6000-EXIT.
    EXIT.
	
7000-CLOSE-CURSOR.	
    EXEC SQL      
	   CLOSE C1
	END-EXEC.
	
	IF SQLCODE NTO = 0
	   DISPLAY 'DB2 CURSOR CLOSE ERROR.'
	   DISPLAY 'SQL CODE: ' SQLCODE
	   MOVE 12 TO RETURN-CODE
	END-IF.

7000-EXIT.
    EXIT.
	
8000-CLOSE-FILES.
    CLOSE VSAMFILE
    IF WS-FILE-STATUS NOT = '00'
       DISPLAY 'VSAM FILE CLOSE ERROR.'
       DISPLAY 'FILE STATUS: ' WS-FILE-STATUS
       MOVE 12 TO RETURN-CODE
    END-IF.

8000-EXIT.
    EXIT.
	
9000-DISPLAY-RESULT.
    DISPLAY 'BANK DB2 TO VSAM PROCESS COMPLETED.'
    DISPLAY 'DB2 RECORDS READ: ' WS-READ-COUNT
    DISPLAY 'VSAM RECORDS WRITE: ' WS-WRITE-COUNT
    DISPLAY 'ERROR RECORDS: ' WS-ERROR-COUNT
	
9000-EXIT.
    EXIT.	
	
	
	
       	   