IDENFICATION DIVISION.
PROGRAM-ID.EODINTRST.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

EXEC SQL
    INCLUDE SQLCA
END-EXEC.

EXEC SQL
    INCLUDE DCLGEN
END-EXEC.

01 WS-ACCOUNT-NO PIC 9(12).
01 WS-BALANCE    PIC S9(13)V99 COMP-3.
01 WS-INTEREST-RATE PIC S9(13)V99 COMP-3.

01 WS-INTEREST-AMOUNT PIC S9(13)V99 COMP-3.
01 WS-CHARGE-AMOUNT PIC S9(13)V99 COMP-3.
01 WS-COUNT PIC S9(4) COMP VALUE 0.

EXEX SQL
    DECLARE C1 CURSOR FOR
        SELECT ACCOUNT_NO,
            BALANCE,
            INTEREST_RATE
        FROM ACCOUNT
        WHERE STATUS = 'A'
END-EXEC.

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY 'END OF THE DAY INTEREST CALCULATION STARTED.'

    EXEC SQL
        OPEN C1
    END-EXEC.

    PERFORM UNTIL SQLCODE = 100

        EXEC SQL
            FETCH C1
            INTO :WS-ACCOUNT-NO,
                :WS-BALANCE,
                :WS-INTEREST-RATE
        END-EXEC.

        EVALUATE TRUE
            WHEN SQLCODE = 0
                PERFORM 1000-CALCULATE-DAILY-INTEREST THRU 1000-EXIT
            WHEN SQLCODE = 100
                DISPLAY 'END OF THE TABLE.'
                DISPLAY 'SQL CODE: ' SQLCODE
            WHEN OTHER
                DISPLAY 'DB2 FETCH ERROR.'
                DISPLAY 'SQL CODE: ' SQLCODE
                DISPLAY 'ACCOUNT NUMBER: ' WS-ACCOUNT-NUMBER
                MOVE 12 TO RETURN-CODE
        END-EVALUATE
    END-PERFORM.

    EXEC SQL
        CLOSE C1
    END-EXEC. 



1000-CALCULATE-DAILY-INTEREST.

    COMPUTE WS-INTEREST-AMOUNT = WS-BALANCE * 
        WS-INTEREST-RATE / 100 / 365.

    MOVE 25 TO WS-CHARGE-AMOUNT.

    COMPUTE WS-BALANCE = WS-BALANCE +
        WS-INTEREST-AMOUNT - WS-CHARGE-AMOUNT.

    EXEC SQL
        UPDATE ACCOUNT
        SET BALANCE = :WS-BALANCE
        WHERE ACCOUNT_NO = :WS-ACCOUNT-NO
    END-EXEC.

    IF SQLCODE NOT = 0
        DISPLAY 'ACCOUNT UPDATE ERROR.'
        DISPLAY 'SQL CODE ' SQLCODE
        DISPLAY 'ACCOUNT NUMBER: ' WS-ACCOUNT-NO
        MOVE 12 TO RETURN-CODE
    ELSE
        ADD 1 TO WS-COUNT
        DISPLAY 'ACCOUNT UPDATED SUCCESSFULLY.'
        DIAPLAY 'ACCOUNT NUMBER: ' WS-ACCOUNT-NO
        DISPLAY 'BALANCE: ' WS-BALANCE
        DISPLAY 'INTEREST AMOUNT: ' WS-INTEREST-AMOUNT
        DISPLAY 'CHARGE AMOUNT: ' WS-CHARGE-AMOUNT
    END-IF.

    IF WS-COUNT >= 100
        DISPLAY '100 RECORDS PROCESSED. COMMITTING TRANSACTION.'
        EXEC SQL
            COMMIT
        END-EXEC.
        MOVE 0 TO WS-COUNT
    END-IF.

1000-EXIT.
    EXIT.
    