IDENTIFICATION DIVISION.
PROGRAM-ID. FUNDTRAN.

DATA DIVISION.
WORKING-STORAGE SECTION.

EXEC SQL
    INCLUDE SQLCA
END-EXEC

01 WS-SOURCE-ACC PIC X(12).
01 WS-DEST-ACC   PIC X(12).
01 WS-AMOUNT     PIC S9(13)V99 COMP-3.
01 WS-SOURCE-BAL PIC S9(13)V99 COMP-3.
01 WS-DEST-BAL   PIC S9(13)V99 COMP-3.

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "FUND TRANSACTION PROCESS STARTED."

    MOVE '100001' TO WS-SOURCE-ACC.
    MOVE '100002' TO WS-DEST-ACC.
    MOVE 10000.00 TO WS-AMOUNT

    EXEC SQL
        SELECT BALANCE
            INTO :WS-SOURCE-BAL
        FROM ACCOUNT
        WHERE ACCOUNT_NO =
                WS-SOURCE-ACC
        FOR UPDATE
    END-EXEC.

    IF SQLCODE NOT = 0
        DISPLAY 'DB2 FETCH ERROR.'
        DISPLAY 'SQL CODE: ' SQLCODE
        MOVE 12 TO RETURN-CODE
        GO BACK
    END-IF.

    IF WS-SOURCE-BAL < WS-AMOUNT
        DISPLAY 'INSUFFICIENT AMOUNT.'
        GO BACK
    END-IF.

    EXEC SQL
        SELECT BALANCE
        INTO :WS-DEST-BAL
        FROM ACCOUNT
        WHERE ACCOUNT_NO =
        WS-DEST-ACC
        FOR UPDATE
    END-EXEC.

    IF SQLCODE NOT = 0
        DISPLAY 'DB2 FETCH ERROR.'
        DISPLAY 'SQL CODE: ' SQLCODE
        MOVE 12 TO RETURN-CODE
        GO BACK
    END-IF.

/*    IF WS-DEST-BAL 
    COMPUTE WS-SOURCE-BAL = WS-SOURCE-BAL -
                WS-AMOUNT

    COMPUTE WS-DEST-BAL = WS-DEST-BAL +
                WS-AMOUNT

    EXEC SQL
        UPDATE ACCOUNT
        SET BALANCE = :WS-SOURCE-BAL
        WHERE ACCOUNT_NO = :WS-SOURCE-ACC
    END-EXEC.

    IF SQLCODE NOT = 0
        EXEC SQL
            ROLLBACK
        END-EXEC
        GOBACK
    END-IF.

    EXEC SQL
        UPDATE ACCOUNT
        SET BALANCE = :WS-DEST-BAL
        WHERE ACCOUNT_NO = :WS-DEST-ACC
    END-EXEC.

    IF SQLCODE NOT = 0
        EXEC SQL
            ROLLBACK
        END-EXEC
        GOBACK
    END-IF.

    EXEC SQL
        COMMIT
    END-EXEC.

    DISPLAY 'TRANSFER SUCCESSFULL.'

    GOBACK.