IDENTIFICATION DIVISION.
PROGRAM-ID. LOANEMI.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INFILE ASSIGN TO INFILEDD.
    ORGANIZATION IS INDEXED
    ACCESS MODE IS SEQUENTIAL/RANDOM
    RECORD KEY IS ACCOUNT_NO
    FILE STATUS IS WS-FILE-STATUS.

    SELECT OUTFILE ASSIGN TO OUTFLDD
    ORGANIZATION IS INDEXED
    ACCESS MODE IS SEQUENTIAL/RANDOM
    RECORD KEY IS ACCOUNT_NO
    FILE STATUS IS WS-FILE-STATUS.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.

EXEC SQL 
    INCLUDE SQLCA
END-EXEC.

01 WS-LOAN-NO PIC X(15).
01 WS-PRINCIPAL PIC S9(13)V99 COMP-3.
01 WS-INTEREST-RATE PIC S9(13)V99 COMP-3.
01 WS-EMI       PIC S9(13)V99 COMP-3.
01 WS-INTEREST  PIC S9(13)V99 COMP-3.
01 WS-PRINCIPAL-PAY PIC S9(13)V99 COMP-3.
01 WS-OUTSTANDING   PIC S9(13)V99 COMP-3.

EXEC SQL
    INCLUDE LOANEMI
END-EXEC.

EXEC SQL
    DECLARE C1 CURSOR FOR
        SELECT LOAN_NO,
        PRINCIPAL,
        INTEREST-RATE,
        EMI,
        OUTSTANDING
        FROM LOAN_ACCOUNT
        WHERE STATUS = 'A'
END-EXEC.

PROCEDURE DIVISION.
    DISPLAY 'LOAN EMI CALCULATION STARTED.'

    EXEC SQL
        OPEN C1
    END-EXEC.

    IF SQLCODE NOT= 0
        DISPLAY 'DB2 CURSOR OPEN FAILED.'
        DISPLAY 'SQL CODE: ' SQLCODE
        MOVE 12 TO RETURN-CODE
        GO BACK
    END-IF.

    PERFORM UNIL SQLCODE = 100

        EXEC SQL
            FETCH C1
            INTO :WS-LOAN-NO,
                :WS-PRINCIPAL,
                :WS-INTEREST-RATE,
                :WS-EMI,
                :WS-OUTSTANDING
        END-EXEC.

        IF SQLCODE = 0
            COMPUTE WS-INTEREST = WS-OUTSTANDING * 
                WS-INTEREST-RATE / 100 /12

            COMPUTE WS-PRINCIPAL-PAY = WS-EMI -
                WS-INTEREST

            COMPUTE WS-OUTSTANDING = WS-OUTSTANDING -
                WS-PRINCIPAL-PAY
