IDENTIFICATION DIVISION.
PROGRAM-ID. CICSREAD.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE DIVISION.
01 WS-REC-DATA PIC X(80).
01 WS-REC-LEN PIC S9(4) COMP.
01 WS-REC-KEY PIC 9(6).
01 WS-KEY-LEN PIC S9(4) COMP.
PROCEDURE DIVISION.
     MOVE +80 TO WS-REC-LEN.
     MOVE '100005' TO WS-REC-KEY.
     MOVE 6 TO WS-KEY-LEN.
     EXEC CICS READ
        FILE('INFILE')
        INTO(WS-REC-DATA)
        LENGTH(WS-REC-LEN)
        RIDFLD(WS-REC-KEY)   -- 
        KEYLENGTH(WS-KEY-LEN)
     END-EXEC.
STOP RUN.


EXEC CICS READ
    FILE(INFILE)
    INTO(WS-READ-REC)
    RIDFLD(WS-ACCNO)
END-EXEC


EXEC CICS READ
    FILE(INFILE)
    INTO(WS-READ-REC)
    LENGTH(WS-REC-LEN)
    RIDFLD(WS-ACC-NO)
    KEYLENGTH(4 / WS-KEY-LEN)
    GENERIC
    GTEQ
    UPDATE
END-EXEC

------------------------------

EXEC CICS WRITE
    FILE(OUTFILE)
    FROM(WS-WRITE-REC)
    LENGTH(WS-REC-LENGTH)
    RIDFLD(WS-ACC-NO)
    KEYLENGTH(WS-KEY-LEN)
END-EXEC


EXEC CICS READ
   FILE(INFILE)
   INTO(WS-REC-DATA)
   LENGTH(WS-REC-LEN)
   RIDFLD(WS-ACC-NO)
   KEYLENGTH(WS-KEY-LEN)
   UPDATE
END-EXEC

MOVE '123456ABCD' TO WS-REC-DATA

EXEC CICS REWRITE
   FILE(OUTFILE)
   FROM(WS-REC-DATA)
   LENGTH(WS-REC-LEN)
END-EXEC


VSAM BROWSE COMMANDS
--------------------
STARTBR
READNEXT
READPREV
RESETBR
ENDBR

        		