IDENTIFICATION DIVISION.
   PROGRAM-ID. VSAMDB2.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT VSAMFILE ASSIGN TO VSAMDD
	   ORGANIZATION IS INDEXED
	   ACCESS MODE IS SEQUENTIAL
	   RECORD KEY IS VSAM-POLICY-NO
	   FILE STATUS IS WS-FILE-STATUS.
DATA DIVISION.
FILE SECTION.
FD VSAMFILE.
   01 VSAM-RECORD.
      05 VSAM-POLICY-NO PIC 9(10).
	  05 VSAM-PREMIMUM PIC 9(7)V99.
	  05 VSAM-DISCOUNT PIC 9(7)V99.
WORKING-STORAGE SECTION.
01 WS-NET-PREMIMUM PIC 9(7)V99.
01 WS-FILE-STATUS PIC 9(3).
01 WS-EOF PIC X(1) VALUE 'N'.

EXEC SQL
   INCLUDE SQLCA
END-EXEC.

PROCEDURE DIVISION.
MAIN-PARA.
    OPEN INPUT VSAMFILE
	IF FILE-STATUS NOT = 0
		DISPLAY 'VSAM FILE OPEN ERROR.'
		MOVE 12 TO RETURN-CODE 
		GO BACK 
	END-IF.

	PERFORM UNTIL WS-EOF='Y'
	  READ VSAMFILE
	     AT END
		    MOVE 'Y' TO WS-EOF
		 NOT AT END
		 	IF VSAM-POLICY_NO = SPACES
				DISPLAY 'INVALID POLICY NUMBER.'
				DISPLAY 'POLICY NUMBER: ' VSAM-POLICY_NO
			END-IF.

	        IF VSAM-PREMIMUM > 5000
				COMPUTE WS-NET-PREMIMUM = VSAM-PREMIMUM - VSAM-DISCOUNT	
				DISPLAY 'POLICY NUMBER: ' VSAM-POLICY_NO
				DISPLAY 'NET PREMIMUM: ' WS-NET_PREMIMUM
			END-IF.

		    EXEC SQL
			    INSERT INTO POLICY_TABLE
				( POLICY_NO,
				  PREMIMUM,
				  DISCOUNT,
				  NET_PREMIMUM
				)
				VALUES
				( :VSAM-POLICY-NO,
				  :VSAM-PREMIMUM,
				  :VSAM-DISCOUNT,
				  :WS-NET-PREMIMUM
				)
			END-EXEC
			
			IF SQLCODE = 0
			   DISPLAY "RECORD INSERTED SUCCESSFULLY."
			ELSE SQLCODE = 100
			   DISPLAY "END OF THE FILE"
			ELSE
			   DISPLAY "DB2 ERROR:" SQLCODE
			   DISPLAY "POLICY NUMBER: " VSAM-POLICY-NO
			END-IF
	  END-READ
	END-PERFORM
	
	EXEC SQL 
	   COMMIT
	END-EXEC
	
	CLOSE VSAMFILE
	STOP RUN.
				  